// Автоматичне приховування банера з підказкою

// Контекст:
// На сторінці після завантаження з’являється підказка для користувача. Через кілька секунд її потрібно автоматично прибрати.

// Базовий HTML:

// <section class="task hint-task">
//   <aside class="hint-banner">
//     <p class="hint-text">Не забудьте перевірити введені дані перед надсиланням.</p>
//   </aside>
// </section>

// Розширене ТЗ:
// · Після завантаження сторінки потрібно запустити setTimeout на 3000 мс.
// · Через 3000 мс елемент .hint-banner потрібно приховати.
// · id таймера потрібно зберегти в окремій змінній.
// · До завершення таймера банер має залишатися видимим.
// · Логіка повинна працювати без додаткових дій користувача

import { refs } from "./refs.js";

const hidenFunction = () => {
    refs.hintBanner.classList.add("hidden");
} 

const timerID = setTimeout(hidenFunction, 3000);

